{
  /**
   * BERT configuration options. see the various sections for 
   * more information. comments are allowed, but other than that
   * make sure that the file is valid json. also make sure to 
   * escape backslashes in windows paths.
   */

  /** 
   * basic BERT configuration. paths in this section can use
   * environment variables (e.g. %userprofile% for your home 
   * directory).
   *
   * NOTE that (for now), changes to this section will not
   * be reloaded. you will need to restart Excel for changes 
   * to take effect.
   */
  "BERT": {

    // per-language configuration. to enable a language, uncomment
    // the language section and (optionally) set the home directory.
    // to disable a language, delete or comment out the block.

    "R": {
      "lib": "%bert_home%\\lib"
    },

    "Julia": {
    },

    // files in this directory will be loaded at startup and reloaded 
    // when changed. the same directory is used for all languages.

    "functionsDirectory": "%userprofile%\\Documents\\BERT2\\functions"

  },

  /**
   * common shell configuration options. these (mostly) come from
   * xtermjs, so see that project for more detail. 
   */
  "shell": {
    
    "theme": {
      "background": "#fff",
      "foreground": "#000",
      "cursor": "#000"
    },

    "fontFamily": "consolas",

    // we like cursor blinking, but (atm) there are some xtermjs 
    // issues that cause hyper-blinking. we'll look into that. 
    // you can disable.

    "cursorBlink": true
    
  },

  /**
   * editor configuration options. these (mostly) come from the monaco
   * editor, so see that project for more detail. 
   */
  "editor": {

    // tip: download fira code and use programming ligatures!
    // https://github.com/tonsky/FiraCode

    /*
    "fontFamily": "Fira Code",
    "fontSize": "13px",
    "fontLigatures": true,
     */

    "theme": "vs",

    "minimap": {
      "enabled": false
    },

    // note this setting was moved from per-language configuration
    // to global (applies to all languages). at the moment we don't
    // support per-language configuration in the editor.

		"tabSize": 2,
    "insertSpaces": true
    
  }

}
